####################### 集合类型 ##############################
# -------- 列表 list --------
# ---- 定义列表 ----
l = [1, 2, 3, 4, 5, 6]
print(l)
print(type(l))

l2 = ["hello", 'world', 1, 2, True, False]      #列表中元素可以使不同类型的
print(l2)

# ---- 访问列表元素 ----
print(l2[1])
print(l2[0:2])

# ---- 列表拼接 ----
L3 = l + l2
print(L3)
L4 = l2 * 3
print(L4)

# ---- 嵌套列表 ----
L5 = [[1, 2], [3, 4]]
print(L5)


# -------- 元组 tuple --------
# ---- 定义元组 ----
T1 = (1, 2, 3)
T2 = (1, 'String', True)

# ---- 元组类型 ----
print(type(T1))

# ---- 定义只有一个元素的元组 ----
print(type((1)))
print(type((1,)))

# ---- 访问元组元素 ----
print(T2[1])
print(T2[0:2])

# ---- 元组拼接 ----
T3 = T1 + T2
print(True)
T4 = T2 * 3
print(T4)


# -------- 序列共有操作 --------
"""
# str，list，tuple都是序列
"""
# 下标
# 切片
# +、*
# in
print(3 in (1, 2, 3))
print(3 not in (1, 2, 3))
# len
print(len([1, 2, 3]))
print(len('Hello World'))
# max, min
print(max([1, 2, 3]))
print(min((1, 2, 3)))


# -------- 集合 set --------
# ---- 集合的定义 ----
S0 = {1, 'str', True}
SS = set()      # 定义空集合
print(S0)
S1 = {1, 3, 2}
print(S1)   # 集合是无序的

# ---- 集合类型 ----
print(type(S1))

# ---- 集合是无重复元素的 ----
S2 = {1, 1, 2, 2, 3, 3}
print(S2)

# ---- 集合操作 ----
print(len(S2))
print(1 in S2)
print(1 not in S2)

# ---- 集合差集 ----
print({1, 2, 3, 4, 5, 6} - {1, 2})

# ---- 集合的交 ----
print({1, 2, 3, 4} & {3, 4, 5, 6})

# ---- 集合的并 ----
print({1, 2, 3, 4} | {3, 4, 5, 6})


# -------- 字典 --------
# ---- 字典定义 ----
D1 = {'1': 1, '2': 2, '3': 3}
print(D1)
D2 = {'1': 1, '1': 2, '2': 2, '3': 3}   # key 不重复
print(D2)
D3 = {1: 1, '1': 2, '2': 2, '3': 3}   # key 可以是不同类型，key必须是不可变类型
print(D3)

# ---- 字典类型 ----
print(type(D1))

# ---- 访问值 ----
print(D1['1'])
